Repository: ItsADanny/HR.Project-B
Catalog: RRS/Resources/*/Resources.*.resx
Languages: nl_nl

# MenuEditor
source: Menu Editor: Please choose an option
nl_nl: Menu Bewerker: kies een optie

# MenuEditorOptionCreate
source: create new item
nl_nl: creeer een nieuw item

# MenuEditorOptionEdit
source: edit existing item
nl_nl: bewerk bestaand item

source: Firstname
nl_nl: Voornaam

source: Lastname
nl_nl: Achternaam

# CreateNewCustSuccess
source: New account created!\n You will be sent back to the start screen
nl_nl: Nieuw account Gecreeerd!\n Je wordt teruggestuurd naar het startscherm

# CreateNewCustError
source: There was an error while trying to create your account\nplease try again later\nyou will be sent back to the start screen
nl_nl: Er was een probleem met het creeeren van het account\nprobeer alstublieft opnieuw\nJe wordt teruggestuurd naar het startscherm

# AdminQuickActions
source: Quick actions
nl_nl: Snelle takenÂ

# QuickAction1
source: View reservations
nl_nl: Bekijk reserveringen

# QuickAction2
source: Timeslot options
nl_nl: Tijdslot opties

# QuickAction3
source: Account options
nl_nl: Account opties

# QuickAction4
source: Menu options
nl_nl: Menu opties

# QuickActionQ
source: Logout
nl_nl: Uitloggen

# ChoiceInput
source: Choice:
nl_nl: Keuze:

# PleaseValidChoice
source: Please input valid choice
nl_nl: Voer een geldige keuze in

# SelectLanguage
source: PLEASE SELECT A LANGUAGE
nl_nl: Voer een geldige taal in

# SelectLang1
source: English
nl_nl: Engels

# SelectLang2
source: Dutch
nl_nl: Nederlands

# InvalidPleaseAgain
source: Invalid option, Please try again
nl_nl: ongeldige keuze, probeer opnieuw

source: Change password
nl_nl: Wachtwoord veranderen

# PleaseSelectAcc
source: Please select an account to change (enter Q to exit):
nl_nl: Selecteer een account om te wijzigen (voer Q in om af te sluiten):

# SuperAdminMenuOpt1
source: Create a new customer account
nl_nl: Maak een nieuw klantaccount aan

# SuperAdminMenuOpt2
source: Create a new admin account
nl_nl: Maak een nieuw beheerderaccount aan

# SuperAdminMenuOpt3
source: Lookup account
nl_nl: Account opzoeken

# SuperAdminMenuOpt4
source: Change accountlevels for an account
nl_nl: Verander het level van een account

# SuperAdminMenuOpt5
source: Delete account
nl_nl: Account verwijderen

# SuperAdminMenuOpt6
source: Change password
nl_nl: Wachtwoord veranderen

# AdminMenuOpt2
source: Lookup account
nl_nl: Account opzoeken

# AdminMenuOpt3
source: Change password
nl_nl: Wachtwoord veranderen

# PleaseSelectAccChange
source: Please select an account to change (enter Q to exit):
nl_nl: Selecteer een account om te wijzigen (voer Q in om af te sluiten):

# PleaseSelectAccLvlChange
source: Please select an accountlevel to change to (enter Q to exit):
nl_nl: Selecteer een accountniveau waarnaar u wilt wijzigen (voer Q in om af te sluiten):

# SelectOpt
source: Selection options:
nl_nl: Selectie opties:

# LookAccOpt1
source: Select by ID
nl_nl: Selecteer op ID

# LookAccOpt2
source: Select by Firstname
nl_nl: Selecteer op voornaam

# LookAccOpt3
source: Select by Lastname
nl_nl: Selecteer op achternaam

# LookAccOpt4
source: Select by E-mail\n\n
nl_nl: Selecteer per e-mail\n\n

# PleaseSelectSelection
source: Please select a selection method (enter Q to exit):
nl_nl: Selecteer een selectiemethode (voer Q in om af te sluiten):

# PlsIDsearch
source: Please input an ID for the user you want to search for:
nl_nl: Voer een ID in voor de gebruiker waarnaar u wilt zoeken:

# IDSearchError
source: Invalid input, please use a valid ID for searching
nl_nl: Ongeldige invoer. Gebruik een geldig ID om te zoeken

# EnterToCont
source: Press enter to continue.
nl_nl: Druk op Enter om door te gaan.

# FNSearchError
source: Invalid input, please use a firstname for searching
nl_nl: Ongeldige invoer. Gebruik een voornaam om te zoeken

# PlsLNSearch
source: Please input a lastname for the user you want to search for:
nl_nl: Voer een achternaam in voor de gebruiker waarnaar u wilt zoeken:

# LNSearchError
source: Invalid input, please use a lastname for searching
nl_nl: Ongeldige invoer. Gebruik een achternaam om te zoeken

# PlsEMSearch
source: Please input an e-mail for the user you want to search for:
nl_nl: Voer een e-mailadres in van de gebruiker waarnaar u wilt zoeken:

# EMSearchError
source: Invalid input, please use an e-mail for searching
nl_nl: Ongeldige invoer, gebruik a.u.b. een e-mailadres om te zoeken

# PlsSelectAccDel
source: Please select an account to delete: \nor enter Q to exit
nl_nl: Selecteer een account om te verwijderen: \nof voer Q in om af te sluiten

# ConfirmDelAcc
source: Are you sure you want to delete this account?
nl_nl: Weet je zeker dat je dit account wilt verwijderen?

source: yes
nl_nl: ja

source: no
nl_nl: nee

# ChooseAccLvl
source: Choose Account Level:
nl_nl: Kies accountniveau:

# PlsCurrPassword
source: Please enter your current password
nl_nl: Voer uw huidige wachtwoord in

# PlsNewPassword
source: \nPlease enter your new password:
nl_nl: \nVoer uw nieuwe wachtwoord in:

# PlsConfNewPassWord
source: \nPlease confirm your new password:
nl_nl: \nBevestig uw nieuwe wachtwoord:

# PasswordSuccess
source: Password changed successfully
nl_nl: Wachtwoord succesvol gewijzigd

# MenuEditorOptionDelete
source: delete existing item
nl_nl: bestaand artikel verwijderen

# MenuEditorOptionView
source: view full menu
nl_nl: bekijk het volledige menu

# SwitchCreate
source: Creating new item...
nl_nl: Nieuw item aanmaken...

# SwitchEdit
source: Editing existing item...
nl_nl: Bestaand item bewerken...

# SwitchDelete
source: Deleting existing item...
nl_nl: Bestaand item verwijderen...

# SwitchView
source: Viewing Menu...
nl_nl: Menu bekijken..

# SwitchExit
source: Exiting...
nl_nl: Afsluiten...

# SwitchError
source: Invalid option, try again
nl_nl: Ongeldige optie, probeer het opnieuw

# ErrorMessage
source: Program error, {0}. Try again.
nl_nl: Programmafout, {0}. Probeer het opnieuw.

# FillMenuFields
source: Fill in the Menu item fields
nl_nl: Vul de velden van het Menu-item in

# FillNameItem
source: Enter Name:
nl_nl: Voer naam in:

# FillDescItem
source: Enter Description:
nl_nl: Voer beschrijving in:

# FoodtypesHeader
source: Foodtypes:
nl_nl: Voedingstypes:

# FillFoodType
source: Enter foodtype:
nl_nl: Voer voedingstype in:

# ItemCreateSuccess
source: Menu Item has been added successfully
nl_nl: Menu-item is succesvol toegevoegd

# ItemCreateError
source: Menu Item could not be added, try again
nl_nl: Menu-item kan niet worden toegevoegd, probeer het opnieuw

# DeleteItemHeader
source: Deleting an item
nl_nl: Een item verwijderen

# FillItemDelete
source: \nEnter name of item to delete:
nl_nl: \nVoer de naam in van het item dat u wilt verwijderen:

# SearchItemThread
source: Searching Item....
nl_nl: Item zoeken....

# ItemDelConfirm
source: Is this the item you want to delete? Confirm Y/N
nl_nl: Is dit het item dat u wilt verwijderen? Bevestig J/N

# ItemDeleteInfo
source: Name: {0}, Description: {1}
nl_nl: Naam: {0}, beschrijving: {1}

# ItemDelSuccess
source: Item deleted Successfully.
nl_nl: Item succesvol verwijderd.

# ItemDelError
source: Item could not be deleted
nl_nl: Het item kon niet worden verwijderd

# ItemDelError2
source: Deletion Cancelled
nl_nl: Verwijdering geannuleerd

# ItemDelNotFound
source: No item has been found
nl_nl: Er is geen item gevonden

# EditItemHeader
source: Editing an item
nl_nl: Een item bewerken

# ItemFieldEditQ
source: What field would you like to edit?\n
nl_nl: Welk veld wilt u bewerken?\n

# ItemFieldEditOpt1
source: Name
nl_nl: Naam

# ItemFieldEditOpt2
source: Description
nl_nl: Beschrijving

# ItemFieldEditOpt3
source: Price
nl_nl: Prijs

# ItemFieldEditOpt4
source: FoodType
nl_nl: Voedingstype

# EditItemTypeHeader
source: Editing an item: {0}
nl_nl: Een item bewerken: {0}

# EnterNameItem
source: Enter the name of the item:
nl_nl: Vul de naam van het item in:

# EnterNewChItem
source: Enter the new {choice} of the item:
nl_nl: Voer de nieuwe {choice} van het item in:

# EditItemSuccess
source: Menu Item \"{name}\" has been added successfully
nl_nl: Menu-item \"{naam}\" is succesvol toegevoegd

# EditItemError
source: Menu Item \"{name}\" could not be changed, try again
nl_nl: Menu-item \"{naam}\" kan niet worden gewijzigd. Probeer het opnieuw

# MenuViewHeader
source: Menu Preview
nl_nl: Menu voorbeeld

source: No items found.
nl_nl: Geen items gevonden.

# ExitMenuPreview
source: Press enter to exit the menu preview
nl_nl: Druk op Enter om het menuvoorbeeld te verlaten

# AdminReservOpt1
source: View reservations
nl_nl: Bekijk reserveringen

# AdminReservOpt2
source: Cancel reservation
nl_nl: Reservering annuleren

# PlsSelectAccChange
source: Please select an account to change (enter Q to exit):
nl_nl: Selecteer een account om te wijzigen (voer Q in om af te sluiten):

# EnterToExit
source: Press ENTER to exit
nl_nl: Druk op ENTER om af te sluiten

# PlsInfoReserv
source: Please input following information requests to create a reservation.\n
nl_nl: Voer de volgende informatieverzoeken in om een ââreservering te maken.\n

# TableNr
source: Table number
nl_nl: Tafel nummer

# CreatingReserv
source: Creating reservation
nl_nl: Reservering aanmaken

# ReservSuccess
source: Reservation created successfully\n\n
nl_nl: Reservering succesvol gemaakt\n\n

# ReservError
source: There was an error while trying to create the reservation, please try it again later.\n\n
nl_nl: Er is een fout opgetreden bij het maken van de reservering. Probeer het later opnieuw.\n\n

# TiSloMenuOpt
source: \nOptions:
nl_nl: \nOpties:

# TiSloMenuOpt1
source: 1 - View timeslots
nl_nl: 1 - Bekijk tijdslots

# TiSloMenuOpt2
source: 2 - Create a new timeslot
nl_nl: 2 - Maak een nieuw tijdslot aan

# TiSloMenuOpt3
source: 3 - Delete timeslot\n\n
nl_nl: 3 - Tijdslot verwijderen\n\n

# PlsSelectOpt
source: Please select an option (enter Q to exit):
nl_nl: Selecteer een optie (voer Q in om af te sluiten):

# DateNewTiSLo
source: \nDate for the new timeslot:
nl_nl: \nDatum voor het nieuwe tijdslot:

source: Start time
nl_nl: Start tijd

source: End time
nl_nl: Eind tijd

# TiSloSuccess
source: Timeslot created, returning to timeslot menu
nl_nl: Tijdslot aangemaakt, terugkeren naar tijdslotmenu

# TiSloError
source: There was a problem while trying to create your timeslot, please try again later
nl_nl: Er is een probleem opgetreden bij het aanmaken van uw tijdslot. Probeer het later opnieuw

# TiSloDeleteSuccess
source: Timeslot deleted, returning to timeslot menu
nl_nl: Tijdslot verwijderd, terugkeren naar tijdslotmenu

# TiSloDeleteError
source: There was an error while trying to delete the selected timeslot, please try again later
nl_nl: Er is een fout opgetreden bij het verwijderen van het geselecteerde tijdslot. Probeer het later opnieuw

# TiSloPreview
source: {0} - date: {1} from {2} until {3}
nl_nl: {0} - datum: {1} van {2} tot {3}

# selectTiSLoToBook
source: Please select a Timeslot you want to book:
nl_nl: Selecteer een tijdslot dat je wilt boeken:

# SelectTiSloBookError
source: Invalid input, please input a valid timeslot number
nl_nl: Ongeldige invoer. Voer een geldig tijdslotnummer in

# SelectTiSloToDel
source: Please select a Timeslot you want to delete:
nl_nl: Selecteer een tijdslot dat je wilt verwijderen:

# ReservFormat
source: {i} - Reservation for: {accounts.FirstName} {accounts.LastName}, Table: {reservation.TableID}, Date: {reservationTimeSlot.GetDate()}, from {reservationTimeSlot.GetStartTime24()} to {reservationTimeSlot.GetEndTime24()}
nl_nl: {i} - Reservering voor: {accounts.FirstName} {accounts.LastName}, tabel: {reservation.TableID}, datum: {reservationTimeSlot.GetDate()}, van {reservationTimeSlot.GetStartTime24()} tot {reservationTimeSlot.GetEndTime24( )}

# PlsSpecialSymbol
source: Password does not contain a special symbol, please use atleast 1 special symbol
nl_nl: Het wachtwoord bevat geen speciaal symbool. Gebruik minimaal 1 speciaal symbool

# PlsPWNumber
source: Password does not contain a number, please use atleast 1 number
nl_nl: Het wachtwoord bevat geen cijfer, gebruik minimaal 1 cijfer

# StringReqError
source: Invalid input, please input a valid {request}
nl_nl: Ongeldige invoer, voer een geldige {request} in

# PlsValidFN
source: Invalid input, please input a valid firstname
nl_nl: Ongeldige invoer. Voer een geldige voornaam in

# UniqueEMError
source: E-mail is already in use, please enter a different e-mail
nl_nl: E-mailadres is al in gebruik, voer een ander e-mailadres in

# ValidEMError
source: Invalid input, please input a valid E-mail
nl_nl: Ongeldige invoer. Voer een geldig e-mailadres in

# DateExample
source: Date (dd/mm/yyyy) (example: 20/11/2024):
nl_nl: Datum (dd/mm/jjjj) (bijvoorbeeld: 20/11/2024):

# ValidDateError
source: Invalid input, please input a valid Date
nl_nl: Ongeldige invoer. Voer een geldige datum in

# AccLevelSuccess
source: Accountlevel for the account of {selectedAccount.FirstName} {selectedAccount.LastName} to level {selectedAccountLevel.ID} - {selectedAccountLevel.Name}, has succeeded
nl_nl: Accountniveau voor het account van {selectedAccount.FirstName} {selectedAccount.LastName} tot niveau {selectedAccountLevel.ID} - {selectedAccountLevel.Name}, is gelukt

# AccLevelError
source: There was an error trying to change the accountlevel for the account of {selectedAccount.FirstName} {selectedAccount.LastName}, please try it again later
nl_nl: Er is een fout opgetreden bij het wijzigen van het accountniveau voor het account van {selectedAccount.FirstName} {selectedAccount.LastName}. Probeer het later opnieuw

# AccIDError
source: Invalid input, An ID can only consist of numbers. Please try it again with a valid number
nl_nl: Ongeldige invoer. Een ID kan alleen uit cijfers bestaan. Probeer het opnieuw met een geldig nummer

# NoAccByFN
source: No results, There were no accounts found with this firstname.
nl_nl: Geen resultaten. Er zijn geen accounts gevonden met deze voornaam.

# NoAccByLN
source: No results, There were no accounts found with this lastname.
nl_nl: Geen resultaten. Er zijn geen accounts gevonden met deze achternaam.
